{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "hidden_size": 2048,
  "intermediate_size": 5632,
  "max_position_embeddings": 16384,
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_key_value_heads": 16,
  "rms_norm_eps": 1e-6,
  "vocab_size": 102400,
  "model_type": "llama",
  "torch_dtype": "bfloat16",
  "tie_word_embeddings": false,
  "transformers_version": "4.33.1"
}
